## Plan Result (sbox_apim)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim
* Update
  * module.api-mgmt.azurerm_api_management.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management" "apim" {
      + additional_location       = (known after apply)
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + hostname_configuration    = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + location                  = (known after apply)
      + management_api_url        = (known after apply)
      + name                      = "sds-api-mgmt-sbox"
      + notification_sender_email = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_address_id      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = (known after apply)
      + publisher_name            = (known after apply)
      + resource_group_name       = "ss-sbox-network-rg"
      + scm_url                   = (known after apply)
      + sku_name                  = (known after apply)
      + tenant_access             = (known after apply)
    }

  # module.api-mgmt.azurerm_api_management.apim will be updated in-place
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox"
        name                          = "sds-api-mgmt-sbox"
      + public_ip_address_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-sbox-private-pip"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (21 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain will be created
  + resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      + api_management_id = (known after apply)
      + id                = (known after apply)

      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "sds-api-mgmt.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "sds-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
      + gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + default_ssl_binding          = true
          + expiry                       = (known after apply)
          + host_name                    = "sds-mtls-api-mgmt-appgw.sandbox.platform.hmcts.net"
          + key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
          + negotiate_client_certificate = true
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_role_assignment.apim will be created
  + resource "azurerm_role_assignment" "apim" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":770,"Program":"tfcmt","SHA1":"","Target":"sbox_apim","Vars":{}} -->